{"context":"The prime minister of Thailand (person b) is currently being interviewed by reporters (person a) about the news that currently on the public interest in front of paliament complex.","discourse":[{"speaker":"a","resp":"ท่านนายกคะ ตั้งแต่เมื่อคืนจนถึงตอนช่วงเช้าในพื้นที่สามจังหวัดชายแดนภาคใต้มีเหตุการณ์ความรุนแรงเกิดขึ้นท่านนายกได้รับรายงานแล้วรึยังคะ","formality":""},{"speaker":"b","resp":"ครับ เพิ่งได้รับเมื่อกี้เลยครับ ได้รับรายงานมานะครับ เดี๋ยวท่านรักษาการณ์ผู้บัญชาการตำรวจแห่งชาติก็จะลงพื้นที่นะครับ เป็นช่วงฤอมะดรเขาก็แสดงกำลังก็ต้องไป เมื่อกี้ผมก็โทรหาท่านผู้บัญชาการทหารบกเหมือนกัน ท่านก็มีความเป้นห่วง เดี๋ยวท่านก็จะสั่งการแล้วก็จะต้องรวบรวมอีกทีนึง นะครับ","formality":""},{"speaker":"a","resp":"มีการรานงานเบื้องต้นไหมคะ ว่าทำไมถึงมาเจาะทำเหตุการณ์หลังเดือนฤอมดร","formality":""},{"speaker":"b","resp":"อ่อมันเป็นการแสดงกำลัง ซึ่งเขาก็ทำเป็นประจำอยู่แล้ว แต่ว่าก็เดี๋ยวต้องไปนั่งหาข้อมูลต่อ นะครับ","formality":""},{"speaker":"a","resp":"ได้สั่งการทางแม่ทัพให้ลงดูแลพื้นที่แล้วรึยังคะ","formality":""},{"speaker":"b","resp":"ผมบอกไปทาง ผ่านไปทางท่านผู้บัญชาการทหารบกแล้วครับ แม่ทัพภาคที่ 4 เขาจะดูแลตรงนี้ให้ครับ","formality":""},{"speaker":"a","resp":"ท่านนายกคะ ขอถามเรื่องของกระแสโหวตคว่ำร่างพรบ. งบประมาณที่เกิดขึ้นหน่อยค่ะ ว่ามีการเช็คอะไรอย่างไรคะ","formality":""},{"speaker":"b","resp":"เท่าที่ทราบไม่มีนะครับ ตรงนี้ครับ เพราะว่ารัฐบาลเองก็เหนียวแน่นหมดทุก ๆ พรรคนะครับ ไม่น่ามีเหตุการณ์อย่างงี้เกิดขึ้น นะครับ","formality":""},{"speaker":"a","resp":"มีการมองว่าข่าววิเคราะห์ไหมว่าข่าวนี้มายังไง","formality":""},{"speaker":"b","resp":"ไม่ทราบนะครับ ไม่มี ก็อ่านหนังสือพิมพ์มีฉบับนึงที่บอกมาอะนะครับ แต่ว่าทางฝ่ายสภาเช็คดูแล้วก็ไม่มีอะไรนะครับ เราเองเราก็ทำงานด้วยกันดีนะครับ ไม่น่ามีอะไรหรอกครับ","formality":""},{"speaker":"a","resp":"ยังมั่นใจในพรรคร่วมรัญบาลไหมคะ","formality":""},{"speaker":"b","resp":"อ่อมั่นใจครับ มั่นใจครับ","formality":""},{"speaker":"a","resp":"ท่านนายกเตรียมรับมือกับเกมการเมืองแบบนี้ไว้ยังไงบ้างคะ","formality":""},{"speaker":"b","resp":"ไม่ได้เตรียมครับ ก็ทำงานไปเรื่อย ๆ ทุกวัน ก็ทำงานเอาผลงานเป้นตัวชี้วัดนะครับ เราเองก็ทำงานกับทุกพรรคได้ดีนะครับ เมื่อคืนนี้ผมเองก็ได้เจอกับท่านอนุทินนะครับ เจอกับท่านทวี ก็ไม่มีอะไร","formality":""},{"speaker":"a","resp":"ไม่มีสัญญาณอะไรใช่ไหมคะ","formality":""},{"speaker":"b","resp":"ไม่มีครับ ไม่มีเลยครับ ถ้าเกิดพูดถึงเรื่อง วัดจากเรื่องงานเป็นหลักนะครับ การทำงานร่วมกันดี ตรงนี้ไม่มีประเด็นอะไรเลยครับ","formality":""},{"speaker":"a","resp":"ได้สอบถามไปยังท่านพลเอกประวิตรหรือทางพลังประชารัฐไหมคะ","formality":""},{"speaker":"b","resp":"ไม่ถามครับ ไม่ได้ถามครับ ไม่ถาม มันก็ต้องให้เกียรติซึ่งกันและกันนะครับ ของพวกนี้ อยู่ด้วยกันนะครับ","formality":""},{"speaker":"a","resp":"ท่านนายกคะ มีได้รับรายงานว่า คือมันมีกระแสข่าวว่า บิ๊กโจ๊กลาราชการตรงนี้ ข้อเท็จจริงเป็นยังไงคะ ท่านนายกได้รับรายงานไหมคะ","formality":""},{"speaker":"b","resp":"ไม่ทราบครับ ไม่ทราบว่าลาไม่ลาครับ ไม่ทราบครับ ลา ลาพักร้อน ถ้าเกิดเป็นเรื่องใช้สิทธิทำตามของส่วนบุคคลไปนะครับ","formality":""},{"speaker":"a","resp":"เป็นการส่งหมายเรียกครั้งที่สองค่ะ ก็อาจจะไม่อยู่ได้พบหมายเรียกอะค่ะ ซึ่งอย่างนี้อาจจะต้องยังไงคะ","formality":""},{"speaker":"b","resp":"ไม่ทราบครับ ทุกอย่างเป็นไปตามขั้นตอนของกระบวนการยุติธรรมนะครับ ผมว่าไปตามกฎหมายไปตามกฎระเบียบนะครับ เอ่อ ราชการนะครับ ผมว่าเรื่องนี้เราพอเหอะ ก็จบเถอะนะครับ เพราะว่าผมก็มีเรื่องอย่างที่ท่านถามคำถามแรกอะ มีเรื่องของภาคใต้มีเรื่องของยาเสพติดมีเรื่องของ เอ่อ หนี้นอกระบบ เยอะแยะไปหมด นะครับ ท่านรักษาการผู้บัญชาการตำรวจแห่งชาติก็มีภารกิจหลักอะ ผมว่าโฟกัสที่เรื่องงานดีกว่า ตรงนั้นก็ปล่อยให้กระบวนการยุติธรรมเป็นตัวเดินไป ส่วนทั้งสองท่านที่ถูกให้มาช่วยราชการ ท่านก็มีหน้าที่ท่านที่ได้รับมอบหมายแล้ว นะครับถ้าเกิดมีการลาพักร้อนอะไรก็ให้ว่าไปตามกฎระเบียบราชการนะครับ","formality":""},{"speaker":"a","resp":"ซึ่งคดีก็ตามกระบวนการเลยใช่ไหมคะ เรื่องคดี","formality":""},{"speaker":"b","resp":"ใช่ครับ","formality":""},{"speaker":"a","resp":"ค่ะ ขอบคุณค่า","formality":""}],"a_formality":"high","b_formality":"high","source":"https:\/\/www.youtube.com\/watch?v=6d3inyxtjbQ","ps":0}
{"context":"Two host (Person a and b) from the news channel opening the program while trying to pick a topic they should start at.","discourse":[{"speaker":"a","resp":"สวัสดีครับ เอนเกม เกมที่แพ้ไม่ได้ อยู่กับผม ออฟ พลวุฒิ สงสกุล กับ คุณเอก ธนกร วงษ์ปัญญานะครับ","formality":""},{"speaker":"b","resp":"ครับ สวัสดีคุณผู้ชมนะครับ แล้วก็ต้องสวัสดีคุณผู้ฟังด้วย เพราะว่าเรามีทางพ็อดแคสด้วย เอนเกมสัปดาห์นี้นะครับคุณผู้ชม ก็เข้าสู่โค้งสุดท้ายของช่วงเดือนมีนาคมแล้ว","formality":""},{"speaker":"a","resp":"หรอ","formality":""},{"speaker":"b","resp":"เออ แปป ๆ เอง คุณออฟ","formality":""},{"speaker":"a","resp":"รู้สึกนานเนอะ เพราะเงินเดือนเริ่มหมดแล้ว","formality":""},{"speaker":"b","resp":"นานมาก เพราะเขาบอกว่ามีนาคมมีหกสัปดาห์ไง เฉพาะเดือนนี้อะมีหกสัปดาห์ อะเขาว่าอย่างงั้น","formality":""},{"speaker":"a","resp":"โหดร้ายมาก","formality":""},{"speaker":"b","resp":"แต่ทีเนี่ย หกสัปดาห์ หรือว่าใกล้ ๆ กับช่วงปลายเนี่ยมีเรื่องร้อนตลอดเลย ตั้งแต่งบประมาณแล้ว ผ่านเรียบร้อยแล้ว งบประมาณผ่านวาระสองเรียบร้อยแล้ว","formality":""},{"speaker":"a","resp":"ได้ใช้เงินแล้วรัฐบาล","formality":""},{"speaker":"b","resp":"ได้ใช้เงินแล้วรัฐบาล แล้วก็ย้อนไปหน่อยคุณออฟ สัปดาห์ที่ผ่านมาเนี่ย เราเจอเรื่องใหญ่ก็คือ ศึกในสำนักงานตำรวจแห่งชาติ","formality":""},{"speaker":"a","resp":"โอโห้","formality":""},{"speaker":"b","resp":"เขาว่าเป็นศึกสีกากี ไปคู่เลย เดี๋ยวค่อยมาขยายความอีกทีหนึ่ง แต่ว่าร้อนกว่านั้น","formality":""},{"speaker":"a","resp":"คืออากาศตอนนี้แหละ","formality":""},{"speaker":"b","resp":"ถูกต้อง นอกจากอากาศตอนนี้แล้ว เผาป่า อาทิตย์ก่อนนู้นก็เป็นเรื่องแล้ว อุณหภูมิรวมถึงค่าฝุ่นพีเอ็มสองจุดห้าที่เชียงใหม่ ที่เป็นเมืองหลวง ย้ายชั่วคราวไป สัปดาห์ก่อน ที่ไปกันทุกพรรค ไปกันทุก เรียกว่า","formality":""},{"speaker":"a","resp":"นายก อดีตนายก แคนดิเดตนายก","formality":""},{"speaker":"b","resp":"รวมกันอยู่นั้นหมด","formality":""},{"speaker":"a","resp":"อะไรกันวุ่นวาย","formality":""},{"speaker":"b","resp":"วุ่นวาย เพราะฉะนั้น เอาเรื่องที่ใกล้ตัวกันก่อนไหม","formality":""},{"speaker":"a","resp":"ครับ จะไปฝุ่นหรือจะไปอะไรก่อน","formality":""},{"speaker":"b","resp":"ฝุ่นเลย","formality":""},{"speaker":"a","resp":"ฝุ่นเลยเหรอ","formality":""},{"speaker":"b","resp":"อืม ผมว่าน่าจะ","formality":""},{"speaker":"a","resp":"ไปฝุ่นเลยนะ","formality":""},{"speaker":"b","resp":"ครับผม","formality":""}],"a_formality":"high","b_formality":"high","source":"https:\/\/www.youtube.com\/watch?v=rbqOBiAV15w","ps":0}
{"context":"The host (person a) from a business interview program asking her guest (person b) to explain about his solar enegy company's products and services.","discourse":[{"speaker":"a","resp":"วันนี้แนนอยู่กับคุณกิตจาก solar ppm แล้วล่ะค่ะ สวัสดีค่า","formality":""},{"speaker":"b","resp":"คุณแนนสวัสดีค้าบ","formality":""},{"speaker":"a","resp":"ค่ะ ขออนุญาตินิดนึงก็คือ เริ่มต้นเนี่ยอยากให้แนะนำให้คนรู้จักเกี่ยวกับโซล่าพีพีเอ็มหน่อยว่าเราเป็นใครทำอะไรบ้างคะ","formality":""},{"speaker":"b","resp":"โอเคครับ งั้นผมขออนุญาติ overview ธุรกิจของโซล่าพีพีเอ็มก่อนนะฮะ คือโซล่าพีพีเอ็มเราเนี่ยมีอยู่สอง business unit นะครับ business unit ที่หนึ่งก็คือจะเป็นส่วนของฝั่งโรงงานประกอบแผงโซล่าในประเทศไทย นะครับ เอ่อ จากอดีตมาเนี่ยแผงโซล่าที่เราประกอบมาเนี่ยจะเป็นแผง อ่า เราเรียกว่าเป็นเทคโนโลยีเดิมแล้วกัน เรียกว่าแผงหกร้อยวัตต์โมโนคริสตัลไลซ์นะครับ เป็นแผงแบบซิงเกิ้ลไซส์ นะครับ ซึ่งจริง ๆ ก็ค่อนข้างที่ะจะเป็นแผงที่มีกำลังการผลิตค่อนข้างสูงแล้วเมื่อเทียบกับแผงที่ available ในตลาดอะนะครับ แล้วก็ในช่วงปีสองพันยี่สิบสามตอนช่วงปลายปีเนี่ย เรามี introduce เทคโนโลยีอีกตัวนึงมา เป็นแผงโมโนคริสตัลไลซ์เหมือนกัน แต่เป็นเอ็นไทป์ ข้อดีของมันเนี่ย มันตอบโจทย์ทั้งในแง่ของการใช้งาน นะครับ แล้วก็ในแง่ของอีเอสจีด้วยเพราะว่าแผงรุ่นใหม่ของเราเนี่ยมันสามารถที่จะใช้งานได้ตลอดสามสิบปีจากเดิมยี่สิบห้าปี","formality":""},{"speaker":"a","resp":"หมายถึงว่าแผงรุ่นเก่าเนี่ยใช้ได้ยี่สิบห้า","formality":""},{"speaker":"b","resp":"ถูกต้อง","formality":""},{"speaker":"a","resp":"แต่รุ่นใหม่","formality":""},{"speaker":"b","resp":"เป็นสามสิบปี","formality":""},{"speaker":"a","resp":"ด้วยราคาที่แตกต่างมากไหมคะ","formality":""},{"speaker":"b","resp":"ด้วยราคาที่เท่ากัน","formality":""},{"speaker":"a","resp":"อ้อ ราคาเท่ากันด้วย","formality":""},{"speaker":"b","resp":"ถูกต้อง ถูกต้องครับ","formality":""},{"speaker":"a","resp":"โอเคค่ะ เชิญต่อค่ะ","formality":""},{"speaker":"b","resp":"แล้วก็ ณ ปัจจุบันนะครับ ในปีสองพันยี่สิบสี่เนี่ยเราก็จะมีการ introduce แผงตัวใหม่ ซึ่งถ้าพูดอินดีเทลเลยเนี่ย ก็จะเป็นแผงที่สามารถที่จะผลิตไฟจากสเปคตรัมของแสงเนี่ยที่หลากหลายมากยิ่งขึ้น มันเปิดโอกาศให้เราใช้ตัวแผงตัวใหม่นี้ในธุรกิจที่เป็นบิวดิ้งอินทริเกตพีวีหรือเป็นลักษณะของฟาซานนะครับ","formality":""},{"speaker":"a","resp":"ค่ะ","formality":""},{"speaker":"b","resp":"ซึ่งก็จะทำ หลาย ๆ องกรณ์ที่อาจจะมีพื้นที่รูฟแอเรียที่ค้อนข้างลิมิตเท็ตเนี่ยก็สามารถที่จะ สามารถตอบโจทย์อีเอสจีได้ด้วยเช่นกันนะครับ เราก็พยายามที่จะมี product ที่จะตอบโจทย์ที่มากมายหลากหลายนะครับ นั้น นั้นคือ overview ละกัน ของทางฝั่งโรงงาน ส่วนที่สองเนี่ยก็จะเป็นในส่วนของการติดตั้ง ซึ่งเป็นพาร์ทวิศวกรรมของบริษัทนะครับ ก็คือเราเนี่ยมีการโพรวายทั้งในส่วนของงานติดตั้งแบบเทิร์นคีย์ คือขายขาดเลย โอนเนอร์ซื้อระบบไปเลย กับอีกแบบนึงก็คือเราเป็นผู้ลงทุนในตัวระบบให้ไม่ว่าจะเป็นอุตสาหกรรมแล้วก็อาคารพาณิชย์ต่าง ๆ มากมายอะนะครับ ซึ่งตรงนี้เนี่ยค่อนข้างมีความสำคัญเพราะว่าเราสามารถที่จะนำโพรดัคของเราแฮนโอเวอร์ภายใต้คุณภาพการติดตั้งที่ดีให้กับลูกค้าได้ ดังนั้นเนี่ย ต้นน้ำเป็นแผงของเรา กลางน้ำเป็นแผงของเราที่ทำการติดตั้ง แต่ปลายน้ำเป็นสิ่งที่สำคัญที่สุด คือเรื่องของการบำรุงรักษา ซึ่งตัวบริษัทเนี่ยก็จะมีการบำรุงรักษาตลอดยี่สิบห้าปีสามสิบปีแล้วแต่ชนิดของแผงโซ่ล่าด้วยเช่นกัน ต้นน้ำกลางน้ำปลายน้ำนั้นคือ business model ของเรา","formality":""}],"a_formality":"high","b_formality":"high","source":"https:\/\/www.youtube.com\/watch?v=E9lrZTooWNw","ps":0}
{"context":"Woman (person a) asking the platform staff (person b) for a way to Chatuchak skytrain station.","discourse":[{"speaker":"a","resp":"พี่คะ ๆ จากตรงนี้ไปบีทีเอสหมอชิตนี่ไปยังไงเหรอคะ?","formality":""},{"speaker":"b","resp":"จากนี่อะเหรอ?","formality":""},{"speaker":"a","resp":"ค่ะ","formality":""},{"speaker":"b","resp":"อืม ก็ถ้าจากตรงนี้ก็ข้ามไปขึ้นรถไฟฝั่งนู้นแล้วไปออกที่เอ็มอาร์ทีจตุจักรได้เลยครับ เดินขึ้นบันไดไปก็เจอเลย","formality":""},{"speaker":"a","resp":"ยังไงนะคะ มันติดกันเหรอคะ?","formality":""},{"speaker":"b","resp":"ใช่ ๆๆ ออกจากสถานีใต้ดินแล้วเนี่ย มันจะเจอบีทีเอสติดกัน ขึ้นจากตรงนั้นต่อได้เลยครับ หมอชิตกับจตุจักรมันติดกัน","formality":""},{"speaker":"a","resp":"ขอบคุณค่ะ","formality":""}],"a_formality":"high","b_formality":"high","source":"0","ps":0}
{"context":"Friends (person a and b) talking via voice chat application about the figurine's pre-order where person b trying to convince person a to save the money for another purpose.","discourse":[{"speaker":"a","resp":"วิค","formality":""},{"speaker":"b","resp":"ครับพ่อ","formality":""},{"speaker":"a","resp":"ช่วยกูด้วย","formality":""},{"speaker":"b","resp":"เรื่องอะไรครับ","formality":""},{"speaker":"a","resp":"ฟิคเกอร์ม้ามันออกเดือน 6 หมดเลย","formality":""},{"speaker":"b","resp":"แล้วกูจะช่วยมึงยังไงครับนั้น","formality":""},{"speaker":"a","resp":"ส่งเงินมา","formality":""},{"speaker":"b","resp":"มึงปล้นกูซะแล้วเหรอ","formality":""},{"speaker":"a","resp":"หยอกเล่น หยอกเล่น แต่ช่วงนี้ต้องประหยัดหน่อยละ","formality":""},{"speaker":"b","resp":"หรือไม่ก็บางทีมึงควรจะลองประหยัดไม่ซื้อพวกตัวที่จะออกเลยดูบ้างนะ","formality":""},{"speaker":"a","resp":"มึงไม่เข้าใจ วิค ข้าวมันอดได้เป็นมื้อ แต่ฟิคม้าถ้าไม่พรีแล้วมันจะหายไปเลยเว้ย","formality":""},{"speaker":"b","resp":"คิดอย่างงี้นี่อนาคตหลายล้านนะครับพี่ หนี้หลายล้าน","formality":""},{"speaker":"a","resp":"เอ้ย กูก็เลยไม่ซื้อรวมเล่มของนักวาดคนนั้นแล้วไงวิค ประหยัดแล้ว","formality":""},{"speaker":"b","resp":"ก็แย่แล้วพี่ชาย แต่ก็นะ เอาที่มึงอยากแหละ เงินมึง กูห้ามไม่ได้อยู่ละ","formality":""},{"speaker":"a","resp":"อืม ขอบคุณที่มานั่งฟังกูบ่นครับ อีกเดี๋ยวกูก็กลับไปทำงานละ","formality":""},{"speaker":"b","resp":"อ่าว จะไปไหนล่ะ","formality":""},{"speaker":"a","resp":"งานกลุ่มถามหาครับ","formality":""},{"speaker":"b","resp":"ไม่ใช่ว่าจบไปแล้วเรอะ","formality":""},{"speaker":"a","resp":"งานใหม่น่ะ เกษตรก็เงี้ยแหละวิค งานกลุ่มแม่งมาทุกวิชาจริง","formality":""},{"speaker":"b","resp":"เชื่อ ไม่เถียง","formality":""}],"a_formality":"low","b_formality":"low","source":"0","ps":0}
{"context":"Office worker (person a) inviting his colleague (person b) for a board game party after work.","discourse":[{"speaker":"a","resp":"เสร็จนี่มึงไปไหนต่อเนี่ยมาร์","formality":""},{"speaker":"b","resp":"อะไรนะ เสียงมึงเบา","formality":""},{"speaker":"a","resp":"เสร็จนี่มึงไปไหนต่อ","formality":""},{"speaker":"b","resp":"อ่อ คงกลับบ้านเลยมั้ง มึงอะ","formality":""},{"speaker":"a","resp":"ก็ว่าจะกลับแหละตอนแรก แต่พี่ซิดนี่เขาเพิ่งมาชวนไปเล่นบอร์ดเกม สนใจปะ","formality":""},{"speaker":"b","resp":"บอร์ดเกมอะไรวะที่จะเล่นกัน","formality":""},{"speaker":"a","resp":"ไม่รู้ว่ะ ไม่ได้ถาม","formality":""},{"speaker":"b","resp":"กูไม่ค่อยอยากเล่นแวร์วูฟอะดิ ยิ่งเพื่อนพี่ซิดนี่ก็เล่นกันแต่แวร์วูฟด้วย","formality":""},{"speaker":"a","resp":"โอเค งั้นสรุปมึงไม่ไปเนอะ กูจะได้บอกพี่เขา","formality":""},{"speaker":"b","resp":"อืม แต่เรื่องกูเบื่อแวร์วูฟนี่ไม่ต้องบอกนะ","formality":""},{"speaker":"a","resp":"เออ ได้ แต่แม่ง หรือกูไม่ไปด้วยอีกคนดีวะ","formality":""},{"speaker":"b","resp":"อ่าว ไหงงั้นแล้วล่ะ","formality":""},{"speaker":"a","resp":"ขี้เกียจอะดิ เดี๋ยวก็โดนลากไปแดกหรูตามเขาอีก เดือนนี้กูยิ่งจน ๆ อยู่","formality":""},{"speaker":"b","resp":"ก็ตีเนียนอ้อนเขาเลย พี่ซิตนี่คับ ช่วงนี้ผมช็อต ๆ อยู่ แต่ถ้าพี่เต็มใจเลี้ยง ผมก็คงไปแหละคับ","formality":""},{"speaker":"a","resp":"อายตายห่า ภาพลักษณ์กลายเป็นรุ่นน้องเกาะแดกหมด เออ กูไม่ไปละ","formality":""},{"speaker":"b","resp":"เปลี่ยนใจไวจังเนาะ แล้วนี่มึงจะไปไหนแทนละเนี่ย","formality":""},{"speaker":"a","resp":"กลับบ้านดูซีรี่ย์แหละมั้ง","formality":""},{"speaker":"b","resp":"เออดี กูกลับละ บาย","formality":""},{"speaker":"a","resp":"บายคับ กลับดี ๆ กลับดี ๆ","formality":""}],"a_formality":"low","b_formality":"low","source":"0","ps":0}
{"context":"Co-workers (person a and b) meet at plaza during weekend, talking about their business today.","discourse":[{"speaker":"a","resp":"อ่าว สวัสดีค่ะเอม ","formality":""},{"speaker":"b","resp":"สวัสดีค่ะนีน่า บังเอิญจังเลย","formality":""},{"speaker":"a","resp":"นี่มาทำอะไรคะเนี่ย","formality":""},{"speaker":"b","resp":"พาลูกมาเรียนพิเศษค่ะ ที่ชั้นสาม","formality":""},{"speaker":"a","resp":"อุ้ย น้องพีทเรียนอะไรคะ","formality":""},{"speaker":"b","resp":"เรียนกลองค่ะ เป็นเด็กชอบเพลงตามคุณพ่อเขาเปี้ยบเลย อยู่บ้านนี่ยึดลำโพงแม่ไปเปิดเพลงของเขาฟังทั้งวันเลยค่ะ","formality":""},{"speaker":"a","resp":"อุ้ย เป็นเด็กมีแพชชั่น","formality":""},{"speaker":"b","resp":"มากค่ะ ไม่รู้มากเกินไปไหมเลยเนี่ย แต่เวลาเรียนก็ดูเขาตั้งใจดีนะคะ ค่อยคุ้มเงินหน่อย แล้วนี่นีน่ามาทำอะไรคะเนี่ย ","formality":""},{"speaker":"a","resp":"มาช็อบปิ้งค่ะ ร้านเครื่องสำอางของห้างแถวบ้านไม่ค่อยใหญ่เท่าไหร่ เลยขับรถมาที่นี่แทน","formality":""},{"speaker":"b","resp":"โอ้ย อีฟแอนด์บอยละสิคะเนี่ย แต่ช็อปที่นี้ใหญ่จริงค่ะ เทียบกับในบางสาขาในเมืองยังใหญ่ไม่เท่าเลย","formality":""},{"speaker":"a","resp":"จริงที่สุด แต่อาจจะเพราะค่าเช่ามันไม่เท่ากันด้วยเนอะ แล้วนี่เอมจะไปไหนต่อคะ","formality":""},{"speaker":"b","resp":"คงไปกินข้าวเที่ยงก่อน แล้วเดี๋ยวค่อยเดินดูของอะไรรอแหละค่ะ","formality":""},{"speaker":"a","resp":"นี่ก็กำลังจะไปร้านอาหารต่อเหมือนกัน ไปด้วยกันเลยไหมคะ หรือเอมมีร้านในใจอยู่แล้วรึเปล่า","formality":""},{"speaker":"b","resp":"ไม่มีเลย ตามฟีลมากตอนนี้ นี่นามีร้านแนะนำไหม","formality":""},{"speaker":"a","resp":"วันนี้ฟีลมาเป็นอุด้งอะ ร้านที่ชั้นใต้ดิน อร่อยมาก สนใจไหมคะ","formality":""},{"speaker":"b","resp":"น่าสนใจมากค่ะพี่สาว ไปสิคะ ๆ","formality":""}],"a_formality":"mid","b_formality":"mid","source":"0","ps":0}
{"context":"Teacher (person a) asking student (person b) about his new years vacation experience after the class ends.","discourse":[{"speaker":"a","resp":"ปีใหม่จะไปไหนมาเนี่ยแทมแทม","formality":""},{"speaker":"b","resp":"ไปเชียงใหม่มาคับจารย์","formality":""},{"speaker":"a","resp":"เอ้ยดี ๆ ๆ อากาศเย็นไหม","formality":""},{"speaker":"b","resp":"โห ตอนเช้านี่เหมือนโดนอบมากกว่าฮะ","formality":""},{"speaker":"a","resp":"อาจารย์เนี่ยคนเชียงใหม่ เมื่อก่อนตอนเด็ก ๆ นะเย็นเจี้ยบ เดินตากลมสบายเลย","formality":""},{"speaker":"b","resp":"สมัยนี้ไปนี่เหงื่อกับเหงื่ออย่างเดียวนะจารย์ ไม่มีแล้วเย็น","formality":""},{"speaker":"a","resp":"แย่ ๆ ๆ ๆ แต่กรุงเทพก็ร้อนพอกันอะ บ่นได้ที่ไหน","formality":""},{"speaker":"b","resp":"จริงคับ แล้วนี่จารย์ไปไหนมาไหมฮะเนี่ย ปีใหม่","formality":""},{"speaker":"a","resp":"บางแสน โอย แก่แล้วก็นั่งรถนานไม่ไหวอะเนอะ เลยเอาแค่ใกล้ ๆ กรุงเทพพอ ใจก็อยากกลับไปบ้านเกิดหรอก แต่ปูนนี้นั่งนาน ๆ ไม่ค่อยได้ละ","formality":""},{"speaker":"b","resp":"แหม่ พูดอย่างงี้แต่เห็นวิ่งรอบสนามทุกเย็นอยู่เลย ","formality":""},{"speaker":"a","resp":"อันนั้นแค่จ็อกกิ้ง วิ่งเหมือนหนุ่ม ๆ ได้ที่ไหนล่ะ เข่าพังหมด เออ ว่าแต่ เดี๋ยวนี้ไม่มาเตะบอลตอนเย็นเลยนะเรา ไปไหนแทนล่ะ","formality":""},{"speaker":"b","resp":"ติดเรียนพิเศษครับเดี๋ยวนี้ ไม่น่าได้ไปเท่าไหร่แล้วแหละคับ","formality":""},{"speaker":"a","resp":"เออ ดีแล้ว วัยนี้ก็เรียนก่อนเนี่ยแหละ ออกกำลังกายฟิตก้งฟิตกล้ามเดี๋ยวตามมาทีหลังก็ได้","formality":""},{"speaker":"b","resp":"จารย์ ไม่มีวัยไหนที่แก่เกินเรียนนะ","formality":""},{"speaker":"a","resp":"ไปคิดไปพูดแบบนี้ตอนสอบ ตอนจะเอ็นจะเข้ามหาลัยสิ เดี๋ยวได้จบตอนแก่แน่","formality":""},{"speaker":"b","resp":"ค้าบ","formality":""},{"speaker":"a","resp":"เออ เดี๋ยวไปต่อแล้ว การบ้านที่สั่งเมื่อวันอังคารก็อย่าลืมทำด้วยนะ","formality":""},{"speaker":"b","resp":"ค้าบ สวัสดีครับอาจารย์","formality":""}],"a_formality":"mid","b_formality":"high","source":"0","ps":0}
{"context":"Mother (person a) discuss with her son (person b) about their dinner today.","discourse":[{"speaker":"a","resp":"ต้า","formality":""},{"speaker":"b","resp":"คับ มีอะไร","formality":""},{"speaker":"a","resp":"เย็นนี้อยากกินอะไร","formality":""},{"speaker":"b","resp":"เย็นนี้เหรอ อืม ข้าวผัดปู","formality":""},{"speaker":"a","resp":"อยากกินเหรอ ","formality":""},{"speaker":"b","resp":"ก็อยาก แม่ไม่อยากเหรอ","formality":""},{"speaker":"a","resp":"เฉย ๆ แต่ก็เพิ่งกินไปเองนะสัปดาห์ที่แล้ว","formality":""},{"speaker":"b","resp":"อ่าว งั้นไม่กินก็ได้ ไก่ทอดไหมล่ะถ้างั้น","formality":""},{"speaker":"a","resp":"เจ้า?","formality":""},{"speaker":"b","resp":"เอ่อ เคเอฟซี","formality":""},{"speaker":"a","resp":"ไว้วันที่ป๊าอยู่บ้านด้วยค่อยสั่งมากินสิ","formality":""},{"speaker":"b","resp":"ร้านเชฟตามสั่งถ้างั้น","formality":""},{"speaker":"a","resp":"เบื่อแล้ว","formality":""},{"speaker":"b","resp":"งั้นแม่บอกดีกว่าว่าอยากกินอะไร ถามต้าทำไมเนี่ย","formality":""},{"speaker":"a","resp":"อะ ๆ ๆ แม่ทำไข่เจียวให้กินไหมถ้างั้น","formality":""},{"speaker":"b","resp":"ได้ แต่เหนื่อยแม่รึเปล่าล่ะ ถ้าลำบากก็สั่งอะไรกินเอาก็ได้","formality":""},{"speaker":"a","resp":"ก็ไม่เหนื่อย","formality":""},{"speaker":"b","resp":"หรืองั้นเอาบะหมี่เจ๊โกวไหม เดี๋ยวขับออกไปซื้อกลับมาก็ได้","formality":""},{"speaker":"a","resp":"ก็ได้","formality":""},{"speaker":"b","resp":"จบ งั้นจะสั่งอะไรพิมพ์มาบอกละกันนะ เดี๋ยวต้าดูอีกทีตอนถึงร้าน จะได้ไม่ลืม","formality":""}],"a_formality":"mid","b_formality":"mid","source":"0","ps":0}
{"context":"Father (person a) asking his son (person b) to go out and buy him a kerosene.","discourse":[{"speaker":"a","resp":"ไอ้วิน","formality":""},{"speaker":"b","resp":"อะไร","formality":""},{"speaker":"a","resp":"อยู่ไหน","formality":""},{"speaker":"b","resp":"ข้างบน ทำไม","formality":""},{"speaker":"a","resp":"ลงมานี่","formality":""},{"speaker":"b","resp":"ทำการบ้านอยู่","formality":""},{"speaker":"a","resp":"กูจะให้ช่วยงาน","formality":""},{"speaker":"b","resp":"เออ งั้นแปป","formality":""},{"speaker":"a","resp":"เร็ว ๆ ด้วย","formality":""},{"speaker":"b","resp":"มีอะไรอะ","formality":""},{"speaker":"a","resp":"มึงออกไปซื้อน้ำมันก๊าสหน่อยขวดนึง","formality":""},{"speaker":"b","resp":"แค่ตรงนี้เองอะนะ เดินไปเองตอนเรียกก็ถึงแล้วมั้ง","formality":""},{"speaker":"a","resp":"มึงเห็นไหมเนี่ยกูทำอะไรอยู่","formality":""},{"speaker":"b","resp":"ล้างมอไซร์ ทำไมอะ เลยตีนยุ่ยเหรอ","formality":""},{"speaker":"a","resp":"เถียงอีกนะมึง นิสัย","formality":""},{"speaker":"b","resp":"เออ ๆ ไปซื้อ ๆ เงินอยู่ไหนล่ะ","formality":""},{"speaker":"a","resp":"วางไว้อยู่บนโต๊ะหินนู่น รีบไปล่ะ","formality":""},{"speaker":"b","resp":"บนโต๊ะมีแค่สี่สิบ พอเหรอ","formality":""},{"speaker":"a","resp":"กูซื้อครั้งล่าสุดแค่สามสิบห้า จะเนียนเอาเงินทอนแดกขนมล่ะสิมึง","formality":""},{"speaker":"b","resp":"ก็ไม่รู้ว่าเท่าไหร่ กูไม่ตรัสรู้ทุกอย่างหรอกพ่อ","formality":""},{"speaker":"a","resp":"เออ ๆ รีบไป","formality":""}],"a_formality":"low","b_formality":"mid","source":"0","ps":0}
